constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2306                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          200;
        startFace       71620;
    }
    outlet
    {
        type            patch;
        nFaces          200;
        startFace       71820;
    }
    bottom
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          80;
        startFace       72020;
    }
    top
    {
        type            patch;
        nFaces          180;
        startFace       72100;
    }
    obstacle
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       72280;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          72000;
        startFace       72380;
    }
)

// ************************************************************************* //
